eksempel/testxml/iti43-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>
		<Action soap:mustUnderstand="true"
			xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RetrieveDocumentSet</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:fb6975fd-603a-426b-85b1-26732fa41551</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://sdsxdsudv.kvalitetsit.dk:9443/repository/services/xds-iti43</To>
		<ReplyTo soap:mustUnderstand="true"
			xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
	</soap:Header>
	<soap:Body>
		<ns2:RetrieveDocumentSetRequest
			xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
			xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
			xmlns:ns2="urn:ihe:iti:xds-b:2007">
			<ns2:DocumentRequest>
				<ns2:RepositoryUniqueId>1.2.208.176.43210.8.88.1.30</ns2:RepositoryUniqueId>
				<ns2:DocumentUniqueId>4619091542759068279.4584476099589391958.1506000680164</ns2:DocumentUniqueId>
			</ns2:DocumentRequest>
		</ns2:RetrieveDocumentSetRequest>
	</soap:Body>
</soap:Envelope>
